---
kind: method
id: M:Autodesk.Revit.DB.ClassificationEntry.HasBadCategoryId
source: html/995f6795-6527-4ac1-5bef-a24d4972fab7.htm
---
# Autodesk.Revit.DB.ClassificationEntry.HasBadCategoryId Method

Checks if the category id is Revit BuiltInCategory id.

## Syntax (C#)
```csharp
public bool HasBadCategoryId()
```

## Returns
True if the category id is not Revit BuiltInCategory id.
 False otherwise.